[
  {
    "id" : 1,
    "title" : "First Post",
    "date" : "01-13-1990",
    "body" : "Remember that one time I wrote in a blog? You may have remembered it, it was called <a href='https://nocableneeded.blogspot.com' target='_blank'>no cable needed</a>. It was great for a while, then I thought it would be wonderful if I wrote many blogs. I created: <a href='http://lifewithtimtim.blogspot.com/' target='_blank'>http://lifewithtimtim.blogspot.com/</a> which was just my life events, <a href='http://codemonkeydba.blogspot.com/' target='_blank'>http://codemonkeydba.blogspot.com/</a> which was work stuff that I found amusing, and <a href='http://thiscityhasbigbuildingsilikefoodbye.blogspot.com/' target='_blank'>I love food</a> which I have written in a totally of 3 times. Wowza, that was crazy. Well, as of today, those are now depricated. I'll be putting posts on all of those soon. Welcome to the new Tim blog. I thought it would be fun to write an open source blogger using github's super neat public hosting site. So, here goes nothing...",
    "tags" : ["first", "blogs"]
  },
  {
    "id" : 2,
    "title" : "Java Needs an Encapsulation Easy Button",
    "date" : "11-15-2015",
    "body" : "We have all done it, some might not even remember why.  You wrote a private variable with public/protected getters and setters.  We do this for encapsulation, so if by some chance you wanted to change what happens when you set or get that value, you can change it with no effect to the code that utilizes your super fancy class.  However, 99.9% of the time, we are just returning or setting the value.  In a dream the other night I had [what I hope to be] a premonition that Java 9 had added @getter and @Setter annotations.  The next day I did a Google search for said software, curious how they dealt with the whole \"the function exists, but it doesn't exist in a file\" thing.  I found Project Lombok.  Neat project, full of useful annotations.  The trick they do is changing your IDE to be okay with no real getter/setter. Neat! I think Java needs to take this project in house and have it be part of the compiler (just like Java is doing with Joda Time, yay!).  In the end it is just space saver for your .java file as the .class would presumably have these methods. However, think of the countless dev hours that you will save with not having to read/write/generate your getters/setters. I mean, look how much cleaner this code is <a href='http://projectlombok.org/features/GetterSetter.html'>here</a>.",
    "tags" : ["work", "java", "repost"]
  },
  {
    "id" : 3,
    "title" : "2015 Chicago Marathon Race Recap",
    "date" : "11-15-2015",
    "body" : "Chicago is one of the best cities in the world. I decided this past spring that I was going to enter the lottery of the Chicago Marathon. If I got it, I'd do it, end of story. Turns out I had to put my money where my mouth was because I got in. A lot of money by the way, $185 for a marathon, ouch! I know its no Ironman entry, but still. Regardless, after said an done I would say it is totally worth it. <br/><br/>Cassi and I got a hotel downtown for 2 nights, which was awesome. We were 2.58 miles from the start which I was a little worried about, but there was a free shuttle. My parents also planned on coming, but my pops got the flu a couple days before the event. Sorry they couldn't make it but I knew they would still be there in my heart as I ran. Cassi, my girlfriend, was an amazing cheerleader! She really helped me out a lot to prepare my mind and body. Race pickup was great! The expo was ridiculously giant. I think we spent a good 2 hours wondering around. It was fanstastic. <br/><br/>The race morning was early, but expected. I got a great night sleep. We jumped on the trolly shuttle around 6am. We got down to the security check point where we stood for 30 minutes. It looked like you could get right in, but Cassi couldn't get through security as it was for participants only. We cuddled for a bit, it was freezing (not really, but it was like 45 degrees which is basically freezing in the fall). Finally I let go of my outer layers, gave them to Cassi (thanks love!) and made my way to the start. <br/><br/>Once I went through the 2 levels of security check points I finally got to the B corral. I did my normal warm up routine. I ran into my good friend Jeremy, whom I haven't seen in about a year. We caught up, and wished each other good luck. I then stood in line for the bathroom for a good 25 minutes, which seemed a bit silly at the time. Before we knew it, we were corralled at the start, ready to take off.<br/><br/>The gun shot off and the timer started. I just started the Chicago Marathon! The first mile was INTENSE! Imagine running faster than you should be elbow to elbow with 40,000 other runners. We quickly caught up to the disabled runners that had helpers. I love that they have these runners on course, but I felt they were going to get trampled. You literally couldn't see more than a couple feet in front of you. While all this was going on Cassi was trucking her way to mile 2. She saw me at mile 2, but I didn't see her. It was really hard to pick people out of the crowd as I was zooming by. After about mile 5 I would say I was finally comfortable with how close people were around me. The miles just flew on by, before I knew it I hit mile 8 where another group of friends from college were watching. I missed them as well, alas, keep on truckin'. Before I knew it I hit the 1/2 way point at a 7:29 min/mile pace. Holy smokes that is way too fast, lolz. At this point I 'saw' Cassi. I say saw with quotes because my mind was being funky. I saw her, but it didn't register until about 3 blocks later. Thank you so much for trucking all over town to see me run love! So after the 1/2 way something bad happened. My knee had sharp pain on the outside. Later I'll figure out it was more my IT band. I kept going, but at a 9:30 min/mi pace. As I went further the time dropped more. I won't focus on the negative too much, but I was really sad for the second half of the race. I had to walk a couple times due to the pain, but I never stopped. Determination! The run itself was phenomenal! There were crowds at every step of the way. I finished at a 3:45, only missed my PR by 3 minutes! After walking through the food/beer/water stations, I found my way to the after party. I went to my letter (L) and sat on the ground. Sitting never felt so good. I got ahold of Cassi and she met me there. This place was a zoo. I was so happy to be reunited with Cassi! She was happy as well and was also relieved I wasn't dead. My family back home and Cassi were getting updates of my time and were worried that I was injured or something. We stayed at the after party for a bit, but then made our way back to the glorious bed at the hotel.<br/><br/>What a great event! I really can't get over it. It may have put me on IR for the foreseeable future, but it was worth it. Life goal, achieved. I may never run another full again, but I'd have to forget the pain from this one before making that decision. Oh before I wrap up, thank you to my friends and family who messaged or called me after the race. I couldn't do these crazy things without your support.<br/><br/><div class='center'><a href='https://goo.gl/photos/zbBzGnfiDe3Eyd5WA'>Photos from the race</a></div>",
    "tags" : ["running", "race recap", "chicago"]
  },
  {
    "id" : 4,
    "title" : "Things Real Blogs Have",
    "date" : "11-19-2015",
    "body" : "I added some features as of late to my blog. I revamped the home page to have a better subtitle feel. I tested on mobile too so fixed some issues there. I also added detail pages. Now if you click the header on any post it'll bring you to a page with just that post. The post URL is really a search on the JSON in the backend. It does a filter, then grabs the first entry in the returned array. Think of it as \"close enough\" browsing. My next goal is to setup a markdown template. In theory I should be able to just have a directory with .md files and my blog will display the content. After that, I'll probably be done for a while. Holidays and all that. Excited, tomorrow is supposed to be the first snow fall. Can't wait to get the fat bike out. If I don't post, happy holidays!",
    "tags" : ["blogs", "winter"]
  }
]
